{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6022469b",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from pathlib import Path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "316bb0f5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1680565\n"
     ]
    }
   ],
   "source": [
    "path = Path(\"../data/responses_1/\")\n",
    "institution_ids = [os.path.basename(p).replace(\".json\", \"\") for p in  path.rglob('*.json')]\n",
    "institution_ids = set(institution_ids)\n",
    "print(len(institution_ids))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2c4f150b",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "citation_index = json.load(open(\"../data/output/citation_index.json\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4fb1e9b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique nodes in the citation network: 8953263\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of unique nodes in the citation network: {len(set(citation_index.keys()))}\")\n",
    "\n",
    "total_edges = 0\n",
    "edges_with_downloaded_ids = 0\n",
    "\n",
    "for node, info in citation_index.items():\n",
    "    index = info.get(\"index\", [])\n",
    "    reverse_index = info.get(\"reverse_index\", [])\n",
    "    if index:\n",
    "        total_edges += len(index)\n",
    "        edges_with_downloaded_ids += sum(1 for cited in index if cited in institution_ids)\n",
    "    del index\n",
    "    del reverse_index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "4703743d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of edges in the citation network: 47991643\n",
      "Number of edges containing ids in the ID set: 22123799\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of edges in the citation network: {total_edges}\")\n",
    "print(f\"Number of edges containing ids in the ID set: {edges_with_downloaded_ids}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b962b4d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique nodes in the citation network and in the ID set: 1680563\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of unique nodes in the citation network and in the ID set: {len(set(citation_index.keys()) & institution_ids)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0cdaebd6",
   "metadata": {},
   "outputs": [],
   "source": [
    "path = Path(\"../data/responses_1/\")\n",
    "institution_ids = [os.path.basename(p).replace(\".json\", \"\") for p in  path.rglob('*.json')]\n",
    "institution_ids = set(institution_ids)\n",
    "print(len(institution_ids))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "f4134518",
   "metadata": {},
   "outputs": [],
   "source": [
    "institution_paths = [\n",
    "    Path(\"../data/responses_1/by_institution/universidade_federal_rio_janei\"),\n",
    "    Path(\"../data/responses_1/by_institution/massachusetts_institute_techno\"),\n",
    "    Path(\"../data/responses_1/by_institution/universidade_federal_sao_carlo\"),\n",
    "    Path(\"../data/responses_1/by_institution/carnegie_mellon_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/universidade_sao_paulo\"),\n",
    "    Path(\"../data/responses_1/by_institution/nanjing_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/university_california_berkeley\"),\n",
    "    Path(\"../data/responses_1/by_institution/eindhoven_university_technolog\"),\n",
    "    Path(\"../data/responses_1/by_institution/national_university_singapore\"),\n",
    "    Path(\"../data/responses_1/by_institution/federal_university_minas_gerai\"),\n",
    "    Path(\"../data/responses_1/by_institution/harvard_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/peking_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/university_melbourne\"),\n",
    "    Path(\"../data/responses_1/by_institution/humboldt-universitat_berlin\"),\n",
    "    Path(\"../data/responses_1/by_institution/university_oxford\"),\n",
    "    Path(\"../data/responses_1/by_institution/university_pennsylvania\"),\n",
    "    Path(\"../data/responses_1/by_institution/stanford_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/university_tokyo\"),\n",
    "    Path(\"../data/responses_1/by_institution/instituto_tecnologico_aeronaut\"),\n",
    "    Path(\"../data/responses_1/by_institution/technical_university_darmstadt\"),\n",
    "    Path(\"../data/responses_1/by_institution/institut_polytechnique_paris\"),\n",
    "    Path(\"../data/responses_1/by_institution/technical_university_munich\"),\n",
    "    Path(\"../data/responses_1/by_institution/vellore_institute_technology_v\"),\n",
    "    Path(\"../data/responses_1/by_institution/wuhan_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/king_s_college_london\"),\n",
    "    Path(\"../data/responses_1/by_institution/tsinghua_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/yale_university\"),\n",
    "    Path(\"../data/responses_1/by_institution/kth_royal_institute_technology\"),\n",
    "    Path(\"../data/responses_1/by_institution/unesp\"),\n",
    "    Path(\"../data/responses_1/by_institution/kyoto_university\")\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4310908f",
   "metadata": {},
   "outputs": [],
   "source": [
    "institution_ids = set()\n",
    "for path in institution_paths:\n",
    "    institution_ids.update([os.path.basename(p).replace(\".json\", \"\") for p in path.rglob('*.json')])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f8765c75",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique institution ids: 153464\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of unique institution ids: {len(institution_ids)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "d60e259d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique institution ids in unicamp: 2018\n",
      "Number of unique institution ids in top_tier: 461\n"
     ]
    }
   ],
   "source": [
    "unicamp_path = Path(\"../data/responses_1/_unicamp_cs\")\n",
    "unicamp_ids = set(os.path.basename(p).replace(\".json\", \"\") for p in unicamp_path.rglob('*.json'))\n",
    "print(f\"Number of unique institution ids in unicamp: {len(unicamp_ids)}\")\n",
    "\n",
    "top_tier_path = Path(\"../data/responses_1/_top_cited_cs\")\n",
    "top_tier_ids = set(os.path.basename(p).replace(\".json\", \"\") for p in top_tier_path.rglob('*.json'))\n",
    "print(f\"Number of unique institution ids in top_tier: {len(top_tier_ids)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "7e1454f1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv(\"../.env\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "55935a48",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "NEO4J_DATABASE = os.getenv(\"NEO4J_DATABASE\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "0b35210c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique article nodes in Neo4j: 49196\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "neo4j_driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "all_articles_query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "RETURN a.openalex_id\n",
    "\"\"\"\n",
    "with neo4j_driver.session(database=NEO4J_DATABASE) as session:\n",
    "    result = session.run(all_articles_query)\n",
    "    article_ids_in_neo4j = set(record[\"a.openalex_id\"] for record in result)\n",
    "print(f\"Number of unique article nodes in Neo4j: {len(article_ids_in_neo4j)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "081af45b",
   "metadata": {},
   "outputs": [],
   "source": [
    "all_citations_query = \"\"\"\n",
    "MATCH (a:Article)-[:CITES]->(b:Article)\n",
    "RETURN a.openalex_id AS citing, b.openalex_id AS cited\n",
    "\"\"\"\n",
    "with neo4j_driver.session(database=NEO4J_DATABASE) as session:\n",
    "    result = session.run(all_citations_query)\n",
    "    citations_in_neo4j = set((record[\"citing\"], record[\"cited\"]) for record in result)\n",
    "print(f\"Number of unique citation edges in Neo4j: {len(citations_in_neo4j)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "5a9da3f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of articles from institutions in the ID set that are present in Neo4j: 6207\n",
      "Number of articles from Unicamp that are present in Neo4j: 1907\n",
      "Number of articles from top tier that are present in Neo4j: 298\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of articles from institutions in the ID set that are present in Neo4j: {len(article_ids_in_neo4j & institution_ids)}\")\n",
    "print(f\"Number of articles from Unicamp that are present in Neo4j: {len(article_ids_in_neo4j & unicamp_ids)}\")\n",
    "print(f\"Number of articles from top tier that are present in Neo4j: {len(article_ids_in_neo4j & top_tier_ids)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e9238dc5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
